Choose changes for review.

#+BEGIN_SRC sqlite :db changes.db :results replace
select * from change
where import_id = (select max(id) from import)
and (subject like '%nfv%' or topic like '%pci%' or subject like '%numa%' or topic like '%numa%' or subject like '%sriov%' or topic like '%sriov%');
#+END_SRC

#+RESULTS:
| I1bb3674f35f83e2a33243103a267b4aff70f852e | sfinucan  |  1 |  1 | openstack/nova | master | bp/feature-classification-ocata           | Extend nfv feature matrix with pinning/NUMA                          | NEW | 1 |  36 |   3 | 2016-06-08 14:32:24 | 2016-12-29 13:59:37 | 30 |
| If03e324d2eb3919a5210ce5e6fffd6d08a7baed7 | jaypipes  | -1 |  0 | openstack/nova | master | bp/nested-resource-providers              | placement: SRIOV PF devices as child providers                       | NEW | 1 | 636 |  79 | 2016-12-25 18:52:23 | 2017-01-16 05:31:23 | 30 |
| I7a801a5544e1139d932ea32a19ff70bcf3365ece | sahid     |  1 |  0 | openstack/nova | master | bp/libvirt-emulator-threads-policy        | numa: update numa usage incording the cpu reserved                   | NEW | 1 |  57 |   1 | 2016-11-22 17:58:01 | 2017-01-13 18:55:05 | 30 |
| Ib6bf4fdae509c42d1c9057a6a09d697cc1d07e18 | sahid     |  1 |  0 | openstack/nova | master | bp/libvirt-emulator-threads-policy        | numa: take into account cpus reserved                                | NEW | 1 | 179 |  36 | 2016-11-22 17:58:01 | 2017-01-13 17:24:20 | 30 |
| I071182c00a05d3866742d0a5f87d597b434e169b | sahid     |  1 |  0 | openstack/nova | master | bp/libvirt-emulator-threads-policy        | numa: fit instance topology with cpus reserved onto cores            | NEW | 1 |  87 |  20 | 2016-11-22 17:58:01 | 2017-01-13 16:06:32 | 30 |
| Ieec2e698d6ca8ce4257e0db2f21e3021b3d7d479 | sahid     |  1 |  0 | openstack/nova | master | bp/libvirt-emulator-threads-policy        | objects: add new field cpus_reserved in NUMACell                     | NEW | 1 |  35 |   3 | 2016-11-22 17:58:01 | 2017-01-13 16:55:06 | 30 |
| If2141e9c0b3558bec9122d8f273a7f39b6ded179 | sahid     | -1 |  0 | openstack/nova | master | bp/libvirt-emulator-threads-policy        | numa: add numa constraints for emulator threads policy               | NEW | 1 | 125 |  10 | 2016-10-11 14:59:14 | 2017-01-13 14:22:33 | 30 |
| I6512310ae87b85eb1d029142b6f5aaa6f91bb2a6 | sfinucan  |  1 |  1 | openstack/nova | master | bug/1636338                               | Fix backwards compatibility for InstanceNUMACell                     | NEW | 1 |  39 |   2 | 2016-11-10 13:56:04 | 2017-01-13 11:09:27 | 30 |
| Ibb2d8caf9898dd776c2b1d3f15a0d81cbf222363 | ndipanov  | -1 | -1 | openstack/nova | master | bug/1417667                               | libvirt: live-migrate updates NUMA and cpus in the XML               | NEW | 0 | 281 |  35 | 2016-03-01 17:46:49 | 2017-01-12 05:21:12 | 30 |
| Ib0827e82b9528cf64eabb3c05ee003c008c736b3 | vladikr   |  1 | -1 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | db: add vlans column to virtual_interface table                      | NEW | 1 |  46 |   1 | 2016-12-02 06:38:55 | 2017-01-12 03:35:32 | 30 |
| I7f87502f6f9a695634f048b049592f1ec3b860c1 | sfinucan  |  1 |  1 | openstack/nova | master | sriov_numa_func_test                      | libvirt: create functional test base class                           | NEW | 1 | 101 | 135 | 2016-12-05 16:08:22 | 2017-01-11 04:07:24 | 30 |
| I0071474191b6304a87661f73c63e6eeef9a01ac7 | vladikr   |  1 | -1 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | objects: vlans field to NetworkInterfaceMetadata object              | NEW | 1 |   8 |   3 | 2016-12-02 06:38:55 | 2017-01-10 09:15:38 | 30 |
| Id7b9f3f1c2107ec604e7f0ef4fbfd31a9e05d0b0 | vladikr   |  1 |  0 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | Adding vlans filed to Device tagging metadata                        | NEW | 1 |  20 |   3 | 2016-12-02 06:38:55 | 2017-01-10 09:35:10 | 30 |
| I9dc3b5990b695da3ea97f31c089bda7f0a359462 | vladikr   |  1 | -1 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | neutron: update vlan in virtual_interface object                     | NEW | 1 |  43 |   3 | 2016-12-02 06:38:55 | 2017-01-10 09:13:09 | 30 |
| Id9627839c38798704dbffac3b52dfd4c4046b598 | sfinucan  |  1 |  1 | openstack/nova | master | feat/numa-refactor                        | Rename '_numa_get_constraints_XXX' functions                         | NEW | 1 |  21 |  21 | 2016-10-11 15:51:59 | 2017-01-06 15:50:20 | 30 |
| I2647b37e54b0d38c43ec50cbeff22490e8b966f6 | vladikr   |  1 | -1 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | objects: adding vlans field to virtual_interface                     | NEW | 1 |  58 |  12 | 2016-12-02 06:38:55 | 2017-01-06 15:41:14 | 30 |
| I4516387b5b27b9a447c98dd5748858b6de634a99 | sfinucan  |  1 |  1 | openstack/nova | master | feat/numa-refactor                        | Standardize '_get_XXX_constraints' functions                         | NEW | 1 |  30 |  41 | 2016-10-11 15:51:59 | 2017-01-06 12:29:53 | 30 |
| I0d4e00fdda7aaf9276cfa31d93bedf19127e86cd | sfinucan  |  1 |  1 | openstack/nova | master | feat/numa-refactor                        | hardware: Flatten functions                                          | NEW | 1 |  55 |  49 | 2016-09-08 15:02:41 | 2017-01-06 12:30:44 | 30 |
| I8c760ed242a8ffd9ad963a5f51364f541909cd4c | sfinucan  |  1 |  1 | openstack/nova | master | sriov_numa_func_test                      | tests: Validate huge pages                                           | NEW | 1 |  57 |   7 | 2016-11-18 15:02:50 | 2017-01-06 12:37:21 | 30 |
| I1efd99afbed23f64b7ba61d2cf449b2a48689baa | sfinucan  |  1 |  1 | openstack/nova | master | sriov_numa_func_test                      | tests: Combine multiple NUMA-generation functions                    | NEW | 1 |  79 |  86 | 2016-11-25 13:19:17 | 2017-01-06 12:06:18 | 30 |
| I7723cfb6a2d2699d809739a4b03c46a300222897 | sfinucan  |  1 |  1 | openstack/nova | master | sriov_numa_func_test                      | tests: Don't reinvent __init__                                       | NEW | 1 |  27 |  32 | 2016-11-25 13:19:17 | 2017-01-06 11:04:42 | 30 |
| Ibd5f0436d8ce2d819f71e6897216f67b4c978407 | sahid     |  1 |  1 | openstack/nova | master | clean-numa-objects                        | objects: remove cpu_topology from __init__ of InstanceNUMATopology   | NEW | 1 |   8 |   7 | 2016-12-07 17:33:48 | 2017-01-05 16:17:58 | 30 |
| I32d5ab51513860475d67ed509777eec23c0e43d0 | sahid     |  1 | -1 | openstack/nova | master | clean-numa-objects                        | objects: remove related pining from __init__ of InstanceNUMATopology | NEW | 1 | 108 |  81 | 2016-12-07 17:33:48 | 2017-01-05 16:03:57 | 30 |
| Ic5cc4c5fc660efcffceff09367424bc5178a4d9b | vladikr   | -1 |  0 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | neutron: virtual interfaces should be created for preexisting ports  | NEW | 1 |   8 |   3 | 2016-12-02 06:38:55 | 2016-12-02 11:28:08 | 30 |
| I8be6bf8c437fc801499b213c2e884defb7900b17 | sfinucan  |  1 |  1 | openstack/nova | master | bp/reserve-numa-with-pci                  | Prefer non-PCI host nodes for non-PCI instances                      | NEW | 1 |  39 |   1 | 2016-09-29 17:46:39 | 2016-12-01 08:48:24 | 30 |
| I79f2c22ff94eaefa9e3569b6729bb8d813e6d8c7 | sfinucan  |  1 |  1 | openstack/nova | master | feat/numa-refactor                        | De-duplicate _numa_get_flavor_XXX_map_list                           | NEW | 1 |  12 |  26 | 2016-10-11 15:51:59 | 2016-12-01 08:29:20 | 30 |
| I04bf7e6b8324dcac6c93b0cb69c38c30fb05be56 | sfinucan  | -1 |  0 | openstack/nova | master | bp/reserve-numa-with-pci                  | Add PCIWeigher                                                       | NEW | 1 | 185 |   0 | 2016-09-29 14:11:58 | 2016-11-28 19:10:37 | 30 |
| I310077a4197579415f54b5bff983d47a40d5ab7b | edand     | -1 |  1 | openstack/nova | master | bp/user-controlled-sriov-ports-allocation | Use utils ANY constant                                               | NEW | 0 |  17 |  18 | 2016-10-18 10:18:16 | 2016-11-26 17:59:24 | 30 |
| Ie07450a88d5a3e85646058d25dc31163970bf9cd | edand     | -1 |  0 | openstack/nova | master | bp/user-controlled-sriov-ports-allocation | User-controlled SR-IOV ports allocation                              | NEW | 0 | 212 |  31 | 2016-09-21 13:58:33 | 2016-11-26 17:35:23 | 30 |
| I1c891b50a3e775031a5419f21a139a4decae0eba | liu-lixiu | -1 | -1 | openstack/nova | master | bug/1598374                               | Modify request numa_topology when resize                             | NEW | 1 |  53 |  11 | 2016-07-11 09:38:41 | 2016-11-11 03:00:56 | 30 |
| I7abf16b996bd68aa7fa1e3a121eae3147a244284 | vladikr   |  1 |  0 | openstack/nova | master | bp/sriov-pf-passthrough-neutron-port-vlan | libvirt: expose virtual interfaces with vlans to metadata            | NEW | 1 |  18 |  10 | 2016-12-02 06:38:55 | 2016-12-26 23:14:06 | 30 |
| Icacda8484c9ede1a0ddf0831bc457b83b1dd6931 | sfinucan  |  1 |  1 | openstack/nova | master | sriov_numa_func_test                      | tests: Remove duplicate NumaHostInfo                                 | NEW | 1 |  49 |  84 | 2016-11-25 13:19:17 | 2016-12-21 02:25:57 | 30 |
| I6bf6b47fb714af7721cd8cc848f49948df90f1e9 | snikitin  | -1 | -1 | openstack/nova | master | bp/share-pci-between-numa-nodes           | [WIP] PIC NUMA policy PoC                                            | NEW | 0 |  96 |  14 | 2016-10-25 11:51:05 | 2016-12-09 16:35:36 | 30 |
| I365efb2dff7a0488983c62441a2cbf022bfe0dd7 | sahid     |  1 |  0 | openstack/nova | master | clean-numa-objects                        | objects: remove pagesize from __init__ of InstanceNUMATopology       | NEW | 1 | 125 |  89 | 2016-12-07 17:33:48 | 2016-12-19 14:55:24 | 30 |

